add imports

In [24]:
import pandas as pd
import matplotlib.pyplot as plt

In [11]:
df = pd.read_csv("../csv/BrusselsAirlines.csv")

In [12]:
df.describe()

,Departure,Destination,Date,Departure time,Arrival time,Stops,Flightnumber,Airports,Duration,Price,Seats
count,93,93,93,93,93,93,93,93,93,93,93
unique,1,1,30,11,16,4,22,13,19,55,10
top,brussel,heraklion,01/04/2023,06:55,08:50,1,['SN3255'],"['Brussels Airlines', 'Ew Discover']",755,None,No information available
freq,93,93,6,20,15,49,11,18,18,7,44

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Departure       93 non-null     object
 1   Destination     93 non-null     object
 2   Date            93 non-null     object
 3   Departure time  93 non-null     object
 4   Arrival time    93 non-null     object
 5   Stops           93 non-null     object
 6   Flightnumber    93 non-null     object
 7   Airports        93 non-null     object
 8   Duration        93 non-null     object
 9   Price           93 non-null     object
 10  Seats           93 non-null     object
dtypes: object(11)
memory usage: 8.1+ KB

In [29]:
df.filter(items=["Departure", "Destination", "Date", "Departure time", "Arrival time", "Stops", "Flightnumber", "Airports", "Duration", "Price", "Seats"])

,Departure,Destination,Date,Departure time,Arrival time,Stops,Flightnumber,Airports,Duration,Price,Seats
0,brussel,heraklion,01/04/2023,05:55,10:20,0,['SN3255'],['Brussels Airlines'],205,392.14,No information available
1,brussel,heraklion,01/04/2023,06:20,14:15,1,"['LX4551', 'LX2350']","['Brussels Airlines', 'Swiss International Air...",415,722.49,No information available
2,brussel,heraklion,01/04/2023,19:15,08:50,1,"['LH5589', 'LH4420']","['Brussels Airlines', 'Ew Discover']",755,596.88,7 stoel(en) over aan deze prijs
3,brussel,heraklion,01/04/2023,19:15,08:50,1,"['LH5589', '4Y1204']","['Brussels Airlines', 'Ew Discover']",755,596.88,7 stoel(en) over aan deze prijs
4,brussel,heraklion,01/04/2023,06:55,16:05,2,"['LH5629', 'LH101', 'LH1296']","['Brussels Airlines', 'Lufthansa', 'Lufthansa']",490,782.11,No information available
...,...,...,...,...,...,...,...,...,...,...,...
88,brussel,heraklion,28/04/2023,19:15,08:50,1,"['LH5589', 'LH4420']","['Brussels Airlines', 'Ew Discover']",755,356.88,No information available
89,brussel,heraklion,28/04/2023,19:15,08:50,1,"['LH5589', '4Y1204']","['Brussels Airlines', 'Ew Discover']",755,356.88,No information available
90,brussel,heraklion,28/04/2023,19:00,08:50,2,"['LH5631', 'LH123', 'LH4420']","['Brussels Airlines', 'Lufthansa', 'Ew Discover']",770,342.32,No information available
91,brussel,heraklion,29/04/2023,None,None,None,None,None,None,None,None
92,brussel,heraklion,30/04/2023,None,None,None,None,None,None,None,None

In [30]:
df["Departure"].value_counts()

brussel    93
Name: Departure, dtype: int64

In [31]:
df["Destination"].value_counts()

heraklion    93
Name: Destination, dtype: int64

In [32]:
df["Date"].value_counts()

01/04/2023    6
08/04/2023    6
22/04/2023    6
02/04/2023    6
15/04/2023    6
23/04/2023    6
09/04/2023    5
28/04/2023    5
07/04/2023    4
14/04/2023    4
25/04/2023    3
20/04/2023    3
24/04/2023    3
13/04/2023    3
27/04/2023    3
17/04/2023    3
18/04/2023    3
19/04/2023    2
05/04/2023    2
11/04/2023    2
26/04/2023    2
12/04/2023    2
29/04/2023    1
16/04/2023    1
21/04/2023    1
10/04/2023    1
06/04/2023    1
04/04/2023    1
03/04/2023    1
30/04/2023    1
Name: Date, dtype: int64

In [33]:
df["Departure time"].value_counts()

06:55    20
19:15    15
09:35    10
07:00     9
05:55     8
06:20     7
None      7
19:20     6
19:00     4
15:00     4
07:55     3
Name: Departure time, dtype: int64

In [34]:
df["Arrival time"].value_counts()

08:50    15
16:05    14
19:55    13
10:20     8
None      7
15:45     6
17:55     5
10:15     4
14:15     3
12:20     3
18:20     3
01:00     3
20:10     3
12:35     3
17:45     2
09:50     1
Name: Arrival time, dtype: int64

In [35]:
df["Stops"].value_counts()

1       49
2       26
0       11
None     7
Name: Stops, dtype: int64

In [36]:
df["Flightnumber"].value_counts()

['SN3255']                        11
None                               7
['LH5589', 'LH4420']               7
['LH5589', '4Y1204']               7
['LH5625', 'LH1758']               7
['LX4545', 'LX8348']               6
['LH5629', 'LH1758']               6
['LH5587', 'LH1296']               6
['LH5629', 'LH099', 'LH1296']      5
['LX4557', 'LX2819', 'LX8348']     4
['LH5631', 'LH5922']               3
['LX4551', 'LX2350']               3
['LH5629', 'LH101', 'LH1296']      3
['LH5625', 'LH5922']               3
['LH5587', 'LH100', 'LH5922']      3
['LX4563', 'LX7477', 'LX8348']     2
['LX4563', 'LX7475', 'LX8348']     2
['LX4563', 'LX2805', 'LX8348']     2
['LX4551', 'LX2809', 'LX8348']     2
['LX4551', 'LX2807', 'LX8348']     2
['OS8176', 'OS9003']               1
['LH5631', 'LH123', 'LH4420']      1
Name: Flightnumber, dtype: int64

In [37]:
df["Airports"].value_counts()

['Brussels Airlines', 'Ew Discover']                                       18
['Brussels Airlines', 'Lufthansa']                                         15
['Brussels Airlines']                                                      11
['Brussels Airlines', 'Swiss International Air Lines', 'Edelweiss Air']    10
['Brussels Airlines', 'Lufthansa', 'Lufthansa']                             8
None                                                                        7
['Brussels Airlines', 'Aegean Airlines']                                    6
['Brussels Airlines', 'Edelweiss Air']                                      6
['Brussels Airlines', 'SWISS RAILWAYS', 'Edelweiss Air']                    4
['Brussels Airlines', 'Swiss International Air Lines']                      3
['Brussels Airlines', 'Lufthansa', 'Aegean Airlines']                       3
['Brussels Airlines', 'Austrian Airlines']                                  1
['Brussels Airlines', 'Lufthansa', 'Ew Discover']                           1
Name: Airports, dtype: int64

In [38]:
df["Duration"].value_counts()

755     18
205     11
490      8
None     7
1415     6
485      6
440      5
1095     4
415      3
735      3
300      3
280      3
720      3
310      3
465      3
625      3
430      2
815      1
770      1
Name: Duration, dtype: int64

In [39]:
df["Price"].value_counts()

None      7
782.11    5
295.88    4
356.88    4
312.58    3
221.24    3
652.14    3
144.88    2
289.67    2
191.58    2
366.11    2
392.14    2
257.35    2
239.58    2
401.58    2
525.67    2
314.35    2
367.59    2
320.59    2
197.14    2
596.88    2
343.58    2
414.88    2
457.14    1
522.11    1
527.49    1
613.58    1
720.67    1
713.58    1
587.11    1
288.14    1
340.14    1
326.63    1
229.59    1
548.58    1
617.11    1
548.24    1
195.59    1
269.63    1
518.58    1
348.38    1
618.59    1
483.24    1
462.49    1
104.58    1
158.14    1
453.58    1
164.59    1
722.49    1
131.58    1
373.24    1
406.11    1
269.58    1
408.67    1
342.32    1
Name: Price, dtype: int64

In [40]:
df["Seats"].value_counts()

No information available           44
2 stoel(en) over aan deze prijs     9
None                                7
8 stoel(en) over aan deze prijs     7
3 stoel(en) over aan deze prijs     7
7 stoel(en) over aan deze prijs     5
1 stoel(en) over aan deze prijs     4
5 stoel(en) over aan deze prijs     4
4 stoel(en) over aan deze prijs     3
6 stoel(en) over aan deze prijs     3
Name: Seats, dtype: int64